/* ЗАДАНИЕ 1

	Группа: ПВ-011
	Ученик: Шелест Александр

	task01.cpp выводит на экран сравнительную таблицу с суммами поездок на трёх разных видах бензина. */
// Загрузка необходимой для работы с вводом-выводом данных библиотеки
#include <iostream>
// Вызов этой комманды позволит не обращаться к std вручную
using namespace std;

// Основная функция программы
int main()
{
	// Добавление поддержки кириллицы
	setlocale(LC_ALL, "Russian");

	// Объявление переменных
	float S, fuelUsage, fuelCost1, fuelCost2, fuelCost3;
	float tripCost1, tripCost2, tripCost3;

// Метка для возвращения в начало программы
start:

	// Очистка экрана
	system("cls");

	// Вывод начального текста на экран
	cout << "=====================================================================\n";
	cout << "|| Сравнительная таблица сумм поездок на трёх разных видах бензина.||\n";
	cout << "=====================================================================\n\n";

	// Запрос на ввод данных с клавиатуры
	cout << "Введите расстояние до пункта назначения (в км) *введите 0 для выхода из программы* : ";
	cin >> S;

	// Если ключевое слово для выхода не было введено...
	if (S != 0)
	{
		cout << "Введите затраты бензина (на 100 км): ";
		cin >> fuelUsage;
		cout << "Последовательно введите стоимость трёх видов бензина (грн/л): \n";
		cin >> fuelCost1 >> fuelCost2 >> fuelCost3;

		// Вычисление стоимости поездок
		// Стоимость поездки = расход топлива за 1 км * расстояние * стоимость бензина за 1 л
		tripCost1 = S * (fuelUsage / 100.) * fuelCost1;
		tripCost2 = S * (fuelUsage / 100.) * fuelCost2;
		tripCost3 = S * (fuelUsage / 100.) * fuelCost3;

		// Очистка экрана
		system("cls");

		// Вывод таблицы на экран
		cout << "\tРасстояние до пункта назначения: " << S << " км\n"
			<< "\tРасход топлива: " << fuelUsage << " л/100 км\n";

		cout << "==================================================================================\n"
			<< "||========================\tТАБЛИЦА РЕЗУЛЬТАТОВ\t========================||\n"
			<< "==================================================================================\n\n";

		cout << "==================================================================================\n"
			<< "||Номер топлива\t\t" << "||Стоимость топлива (грн/л)\t" << "||Стоимость поездки(грн)||\n"
			<< "==================================================================================\n";

		cout << "||\t1" << "\t\t||\t\t" << fuelCost1 << "\t\t||\t" << tripCost1 << "\t\t||\n"
			<< "==================================================================================\n";

		cout << "||\t2" << "\t\t||\t\t" << fuelCost2 << "\t\t||\t" << tripCost2 << "\t\t||\n"
			<< "==================================================================================\n";

		cout << "||\t3" << "\t\t||\t\t" << fuelCost3 << "\t\t||\t" << tripCost3 << "\t\t||\n"
			<< "==================================================================================\n";

		// Пауза программы
		system("pause");

		// Возврат в начало программы
		goto start;
	}

	// Объявление успешного завершения программы
	return 0;
}